read -sv day02.sv
hierarchy -top day02
proc; opt 
techmap; opt
write_verilog synth.v
show -prefix day02 -colors 1
